<?php
// $oldStructure = array('',array('أ','ب','ج','د'),'a2','امتحان_تجربه_علي_الفصل_الثاني كامل^2085139841^س1.PNG','','',array('أ','ب','ج','د'),'a0','امتحان_تجربه_علي_الفصل_الثاني كامل^282210998^س2.PNG','','',array('أ','ب','ج','د'),'a3','امتحان_تجربه_علي_الفصل_الثاني كامل^415342120^س3.PNG','','',array('أ','ب','ج','د'),'a1','امتحان_تجربه_علي_الفصل_الثاني كامل^300403449^س4.PNG','','',array('ا','ب','ج','د'),'a1','امتحان_تجربه_علي_الفصل_الثاني كامل^186025589^س5.PNG','','',array('ا','ب','ج','د'),'a2','امتحان_تجربه_علي_الفصل_الثاني كامل^1454355500^س6.PNG','','',array('ا','ب','ج','د'),'a2','امتحان_تجربه_علي_الفصل_الثاني كامل^1871277165^س7.PNG','','',array('ا','ب','ج','د'),'a1','امتحان_تجربه_علي_الفصل_الثاني كامل^1095963454^س8.PNG','','',array('ا','ب','ج','د'),'a0','امتحان_تجربه_علي_الفصل_الثاني كامل^816337734^س9.PNG','','',array('ا','ب','ج','د'),'a2','امتحان_تجربه_علي_الفصل_الثاني كامل^931962545^س10.PNG','','',array('ا','ب','ج','د'),'a0','امتحان_تجربه_علي_الفصل_الثاني كامل^1521531751^س11.PNG','','',array('ا','ب','ج','د'),'a3','امتحان_تجربه_علي_الفصل_الثاني كامل^1808183844^س12.PNG','','',array('ا','ب','ج','د'),'a2','امتحان_تجربه_علي_الفصل_الثاني كامل^364739230^س13.PNG','','',array('ا','ب','ج','د'),'a3','امتحان_تجربه_علي_الفصل_الثاني كامل^955016802^س14.PNG','','',array('ا','ب','ج','د'),'a1','امتحان_تجربه_علي_الفصل_الثاني كامل^868150355^س15.PNG','',);
$exam = 'a:3:{i:0;a:8:{s:1:"q";s:0:"";s:1:"i";b:0;s:2:"a0";s:0:"";s:2:"a1";s:0:"";s:2:"a2";s:0:"";s:2:"a3";s:0:"";s:2:"at";s:0:"";s:1:"n";s:0:"";}i:1;a:8:{s:1:"q";s:0:"";s:1:"i";b:0;s:2:"a0";s:0:"";s:2:"a1";s:0:"";s:2:"a2";s:0:"";s:2:"a3";s:0:"";s:2:"at";s:0:"";s:1:"n";s:0:"";}i:2;a:8:{s:1:"q";s:0:"";s:1:"i";b:0;s:2:"a0";s:0:"";s:2:"a1";s:0:"";s:2:"a2";s:0:"";s:2:"a3";s:0:"";s:2:"at";s:0:"";s:1:"n";s:0:"";}}';
 $newStructure = [];
//
// for ($i = 0; $i < count($exam); $i += 5) {
//     $m=0;
//    
//     $newStructure[] = [
//         "q" => $oldStructure[$i],
//         "i" => str_replace('^', 'aa', $oldStructure[$i + 3]) ?? "", // Optional image source
//         "a1" => $oldStructure[$i+1][$m++],
//         "a2" => $oldStructure[$i+1][$m++],
//         "a3" => $oldStructure[$i+1][$m++],
//         "a4" => $oldStructure[$i+1][$m],
//         "ta" => $oldStructure[$i+2],
//         "n" => $oldStructure[$i + 4] ?? "" // Optional note
//     ];
// }
 // $newStructure = addslashes(serialize($newStructure));
// $serialized_array = serialize($newStructure);
// $hash = addslashes($serialized_array);
 $unhas = stripslashes($exam);
 $un = unserialize($unhas) ;
  echo "<pre>";
  print_r($un);
  echo "</pre>";


// $serialized = "a:10:{i:0;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:1;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:2;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:3;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:4;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:5;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:6;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:7;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:8;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}i:9;a:8:{s:1:\"q\";s:0:\"\";s:1:\"i\";b:0;s:2:\"a0\";s:0:\"\";s:2:\"a1\";s:0:\"\";s:2:\"a2\";s:0:\"\";s:2:\"a3\";s:0:\"\";s:2:\"at\";s:0:\"\";s:1:\"n\";s:0:\"\";}}";
// echo "<pre>";
// print_r((unserialize(stripcslashes($serialized))));
// echo "</pre>";
//
//$x = 0;
//
//for($i=0; $i < 10 ; $i++){
//    $x += $i;
//}